tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "xwmx/taps"
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Simple, fast and user-friendly alternative to find
brew "fd"
brew "fontconfig"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Image manipulation library
brew "jpeg"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Mac App Store command-line interface
brew "mas"
# Object-relational database system
brew "postgresql"
brew "ripgrep"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
brew "xwmx/taps/nb"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GUI client for PostgreSQL databases
cask "postico"
cask "rectangle"
# Video communication and virtual meeting platform
cask "zoom"
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
